app/views/orders/_form.html.erb


                     <% @user= User.where(:id => friend[0]['id']) %>
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1