app/controllers/friendships_controller.rb

  def index
    @friendships = Friendship.where(user_id: current_user.id)
    #@friendships = Friendship.all

    @friendship = Friendship.new
    @users = User.all
---
SELECT `users`.* FROM `users`

  def create
    @usersByEmail = User.find_by(email: friendship_params[:friend_id])

    if @usersByEmail

      if @usersByEmail.id == current_user.id || Friendship.find_by(user_id: friendship_params[:user_id], friend_id: @usersByEmail.id )

        respond_to do |format|
            format.html { redirect_to friendships_url, notice: 'Friendship was Not created.' }
        end

      else
        @friendship = Friendship.new(friend_id: @usersByEmail.id, user_id: friendship_params[:user_id])
        respond_to do |format|
          if @friendship.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'nesma@gmail.com'
SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`friend_id` = 1  ORDER BY `friendships`.`id` ASC LIMIT 1
INSERT INTO `friendships` (`friend_id`, `user_id`, `created_at`, `updated_at`) VALUES (1, 1, '2016-04-23 19:41:44', '2016-04-23 19:41:44')

  def update
    respond_to do |format|
      if @friendship.update(friendship_params)
---
UPDATE `friendships` SET `friend_id` = 2, `updated_at` = '2016-04-24 18:41:32' WHERE `friendships`.`id` = 1

  def destroy
    @friendship.destroy
---
DELETE FROM `friendships` WHERE `friendships`.`id` = 8

    def set_friendship
      @friendship = Friendship.find(params[:id])
---
SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`id` = NULL LIMIT 1