app/controllers/inviteds_controller.rb

SELECT `inviteds`.* FROM `inviteds`
---
  def index
    @inviteds = Invited.all