app/controllers/notifications_controller.rb

	def index
		@notifications = Notification.where(recipient: current_user).unread
---
SELECT `notifications`.* FROM `notifications` WHERE `notifications`.`recipient_id` = 3

	def mark_as_read
		@notifications = Notification.where(recipient: current_user).unread
		@notifications.update_all(read_at: Time.zone.now)
---
UPDATE `notifications` SET `notifications`.`read_at` = '2016-04-22 21:41:11' WHERE `notifications`.`recipient_id` = 3 AND `notifications`.`read_at` IS NULL

	def join
	    @actor=User.find_by id: params[:user_id]
	    @orderCreator=User.find_by id: params[:creator_id]
	    @order=Order.find_by id: params[:order_id]

	    Ordetail.create(user_id: params[:user_id] , order_id: params[:order_id])

	    Notification.create(recipient: @orderCreator, actor: @actor, action: "joined", notifiable: @order )
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 71 LIMIT 1
INSERT INTO `ordetails` (`user_id`, `order_id`, `created_at`, `updated_at`) VALUES (3, 71, '2016-04-24 02:38:38', '2016-04-24 02:38:38')
INSERT INTO `notifications` (`recipient_id`, `actor_id`, `action`, `notifiable_id`, `notifiable_type`, `created_at`, `updated_at`) VALUES (2, 3, 'joined', 71, 'Order', '2016-04-24 02:38:38', '2016-04-24 02:38:38')