app/controllers/orders_controller.rb

   def show
  @ordetail = Ordetail.new
  @ordered_list = Ordetail.where(:order_id => params[:id]).paginate(:page => params[:page],  :per_page => 5)

   @inviteds = Invited.where(:order_id => @order.id)

         @invitedall=[]
         @i=0
         @inviteds.each  do |invited|

           @invitedall[@i]=User.where(:id => invited.user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1