app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders`
---
  def index
    @orders = Order.all

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
  def new
    @user=User.find_by id:current_user.id

INSERT INTO `orders` (`for`, `res_name`, `user_id`, `status`, `created_at`, `updated_at`) VALUES ('dinner', 'rosto', 1, 'waiting', '2016-04-22 18:02:26', '2016-04-22 18:02:26')
SELECT `inviteds`.* FROM `inviteds`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `notifications` (`recipient_id`, `actor_id`, `action`, `notifiable_id`, `notifiable_type`, `created_at`, `updated_at`) VALUES (3, 1, 'invited', 17, 'Order', '2016-04-22 19:38:30', '2016-04-22 19:38:30')
---
  def create
    @order = Order.new(order_params)
    @order['status']='waiting'

    respond_to do |format|
      if @order.save
        # @invited=Invited.find_by order_id:@order['id']
        # (@invited.users.unique-[current_user]).each do |user|
        @inviteds=Invited.all
         @inviteds.each do |invited|
          @inviteduser=User.find_by id: invited.user_id
          Notification.create(recipient: @inviteduser, actor: current_user, action: "invited", notifiable: @order )

SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
---
    def set_order
      @order = Order.find(params[:id])