app/controllers/ordetails_controller.rb

  def index
    @ordetails = Ordetail.all
---
SELECT `ordetails`.* FROM `ordetails`

  def new

      @order=Order.where(:id => params[:order_id])
      @order=@order[0]
      if @order
          if @order.status != 'finished'
                  @checkjoined=Ordetail.where(:order_id => @order.id).where(:user_id => current_user.id)
                  @checkfriend=Friendship.where(:user_id =>1)


               # if current_user.id == @order.user_id or @checkjoined.present?

                   @ordetail = Ordetail.new(order_id: params[:order_id])
                   @ordered_list = Ordetail.where(order_id: params[:order_id] , :user_id => current_user.id).paginate(:page => params[:page], :per_page => 5)
                   @user=User.where(:id => @order.user_id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1

  def join
    @actor=User.find_by id: params[:user_id]
    @orderCreator=User.find_by id: params[:creator_id]
    @order=Order.find_by id: params[:order_id]

    if Notification.find_by(actor_id: params[:user_id] , notifiable_id: params[:order_id]).blank?
    # no  record for this id
      Ordetail.create(user_id: params[:user_id] , order_id: params[:order_id])
      Notification.create(recipient: @orderCreator, actor: @actor, action: "joined", notifiable: @order )
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 64 LIMIT 1
INSERT INTO `ordetails` (`user_id`, `order_id`, `created_at`, `updated_at`) VALUES (3, 4, '2016-04-23 01:44:51', '2016-04-23 01:44:51')
INSERT INTO `notifications` (`recipient_id`, `actor_id`, `action`, `notifiable_id`, `notifiable_type`, `created_at`, `updated_at`) VALUES (2, 3, 'joined', 64, 'Order', '2016-04-24 01:38:20', '2016-04-24 01:38:20')

    def set_ordetail
      @ordetail = Ordetail.find(params[:id])
---
SELECT  `ordetails`.* FROM `ordetails` WHERE `ordetails`.`id` = 0 LIMIT 1